# 1
# Дан словарь:
# tst = {
# 	'a': 1,
# 	'b': 2,
# 	'c': 3,
# 	'd': 4,
# 	'e': 5
# }
# Выведите в консоль его индексы и ключи в виде кортежа.

tst = {
	'a': 1,
	'b': 2,
	'c': 3,
	'd': 4,
	'e': 5
}

for item in enumerate(tst):
    print(item)
    
# 2
# Дан словарь:
# tst = {
# 	'1': 11,
# 	'2': 12,
# 	'3': 13,
# 	'4': 14
# }
# Выведите в консоль его индексы и ключи.

tst = {
	'1': 11,
	'2': 12,
	'3': 13,
	'4': 14
}

for item in enumerate(tst):
    print(item)
    
# 3
# Дан словарь:
# tst = {
# 	'x': 10,
# 	'y': 20,
# 	'z': 30
# }
# Выведите в консоль его ключи и индексы.

tst = {
	'x': 10,
	'y': 20,
	'z': 30
}
for key, index in enumerate(tst):
    print(index, key)