# 1
# Дан следующий код:
# tst = 12
# if tst > 0:
# 	print('+++')
# else:
# 	print('---')
# Перепишите его с помощью тернарного оператора.
tst = 12
print('+++' if tst > 0 else '---') # +++

# 2
# Дан следующий код:
# tst = 'abcde'
# if 'a' in tst:
# 	print('+++')
# else:
# 	print('---')
# Перепишите его с помощью тернарного оператора.

tst = 'abcde'
print('+++' if 'a' in tst else '---') # +++