import re          

# 1.Дана строка:

txt = '123 aaa 456 bbb 789'
# Выведите список подстрок, содержащих цифры.
res = re.findall('\d', txt)
print(res) # ['1', '2', '3', '4', '5', '6', '7', '8', '9']

# 2.Дана строка:

txt = 'abc 123 def 456 789'
# Выведите список подстрок, содержащих буквы.
res = re.findall('[a-zA-Z]', txt)
print(res) # ['a', 'b', 'c', 'd', 'e', 'f']