# 1.Дан список:
# lst = [
# 	[1, 2, 3],
# 	[4, 5, 6],
# 	[7, 8, 9],
# ]
# Выведите из него числа 2, 4 и 8.

lst = [
	[1, 2, 3],
	[4, 5, 6],
	[7, 8, 9],
]
print(lst[0][1])#2
print(lst[1][0])#4
print(lst[2][1])#8

# 2.Дан список:

lst = [
	['a', 'b'],
	{'c': 1, 'd': 2},
	{'e': 3, 'f': 4}
]
# Выведите из него числа 1, 3.
print(lst[1]['c'])#1
print(lst[2]['e'])#3