# 1
# Дан словарь:
# tst = {
# 	'a': 1,
# 	'b': 2,
# 	'c': 3,
# 	'd': 4,
# 	'e': 5
# }
# Выведите в консоль его значения:
# 1
# 2
# 3
# 4
# 5

tst = {
	'a': 1,
	'b': 2,
	'c': 3,
	'd': 4,
	'e': 5
}
for key in tst:
    print(tst[key])


# 2
# Дан словарь:
# tst = {
# 	'a': 1,
# 	'b': 2,
# 	'c': 3,
# 	'd': 4,
# 	'e': 5
# }
# Найдите сумму его значений.

tst = {
	'a': 1,
	'b': 2,
	'c': 3,
	'd': 4,
	'e': 5
}
res =  0
for key in tst:
    res += tst[key]
    print(res)

# 3
# Дан словарь:
# tst = {
# 	'1': 'a',
# 	'2': 'b',
# 	'3': 'c',
# 	'4': 'd'
# }
# Получите из его значений следующую строку:
# 'abcd'


tst = {
	'1': 'a',
	'2': 'b',
	'3': 'c',
	'4': 'd'
    }
res =  ''
for key in tst:
    res += tst[key]
    print(res)

 
