# 1.Дан список словарей:

lst = [
	{
		'a': 1,
		'b': 2,
		'c': 3
	},
	{
		'a': 4,
		'b': 5,
		'c': 6
	},
	{
		'a': 7,
		'b': 8,
		'c': 9,
	},
]
# С помощью цикла найдите сумму всех чисел.
res = 0
for sub in lst:
    for key in sub:
        res += sub[key]
        print(res) #45

# 2.Измените код предыдущей задачи так, чтобы вывести из списка пары ключ-значение словаря:

# 'a' 1
# 'b' 2
# 'c' 3
# 'a' 4
# 'b' 5
# 'c' 6
# 'a' 7
# 'b' 8
# 'c' 9

lst = [
	{
		'a': 1,
		'b': 2,
		'c': 3
	},
	{
		'a': 4,
		'b': 5,
		'c': 6
	},
	{
		'a': 7,
		'b': 8,
		'c': 9,
	},
]

for sub in lst:
    for key in sub:
        print(key, sub[key]) # a 1b 2c 3a 4b 5c 6a 7b 8c 9
        