# 1
# Дан список:
# tst = ['1', '2', '3', '4', '5']
# Переберите его циклом и выведите в консоль каждый элемент.

tst = ['1', '2', '3', '4', '5']
for el in tst:
    print(el)

# 2
# Дан кортеж:
# tst = (1, 2, 3, 4, 5)
# Переберите его циклом и выведите в консоль каждый элемент

tst = (1, 2, 3, 4, 5)
for el in tst:
    print(el) 

# 3
# Дано множество:
# tst = {'a', 'b', 'c', 'd', 'e'}
# Переберите его циклом и выведите в консоль каждый элемент.

tst = {'a', 'b', 'c', 'd', 'e'}
for el in tst:
    print(el)

# 4
# Дана строка:
# tst = 'abcde'
# Переберите ее циклом и выведите в консоль каждый символ.
tst = 'abcde'
for el in tst:
    print(el)

# 5
# Дано число:
# tst = 12345
# Переберите его циклом и выведите в консоль каждую цифру.

tst = 12345
for el in str(tst):
    print(el)

# 6
# Дан список:
# tst = [1, 2, 3, 4, 5]
# Прибавьте к его каждому элементу число 2 и выведите результат в консоль.

tst = [1, 2, 3, 4, 5]
for el in tst:
    print(el)