import time

# 1.Выведите на экран текущий epoch.
res = time.time()
print(res) # 1735733079.436946