import re   

# 1.Дана строка:

txt = '12 34 56 78'
# Поменяйте местами цифры во всех двухзначных числах.
res = re.sub('(\d)(\d) (\d)(\d) (\d)(\d) (\d)(\d)', '\\2\\1 \\4\\3 \\6\\5 \\8\\7' , txt)
print(res) # 21 43 65 87


# 2.Дана строка с датой:

txt = '31.12.2025'
# Преобразуйте эту дату в '2025.12.31'.
res = re.sub('(\d{2}).(\d{2}).(\d{4})', '\\3.\\2.\\1' , txt)
print(res) # 2025.12.31