import re

# 1. Дана строка:

txt = 'x[]z x[[]]z x()z'
# Напишите регулярку, которая найдет все слова по шаблону: буква 'x', затем квадратные скобки любое количество раз, затем буква 'z'.
res = re.findall('x[\[\]]+z', txt)
print(res) # ['x[]z', 'x[[]]z']


# 2. Дана строка:

txt = 'x[]z x{}z x.z x()z x([])z'
# Напишите регулярку, которая найдет все слова по шаблону: буква 'x', затем любое количество любых скобок, затем буква 'z'.
res = re.findall('x[\[\]\{\}(\\)]+z', txt)
print(res) # ['x[]z', 'x{}z', 'x()z', 'x([])z']