import datetime

# 1.Выведите в консоль текущий день.
res = datetime.date.today()
print(res.day) # 30

# 2.Выведите в консоль текущий месяц.
res = datetime.date.today()
print(res.month) # 12

# 3.Выведите в консоль текущий год.
res = datetime.date.today()
print(res.year) # 2024