# 1
# Выведите в консоль четные числа от  до 100.

for num in range(0, 101, 2):
    print(num)

# 2
# Выведите в консоль числа от -10 до 10.

for num in range(-10, 11, 1):
    print(num)

# 3
# Напишите код, чтобы получить следующие числа:
# 20
# 17
# 14
# 11
# 8
# 5
# 2

for num in range(20, 1, -1):
    print(num)
