# 1
# Дан словарь:
# tst = {
# 	'a': 1,
# 	'b': 2,
# 	'c': 3,
# 	'd': 4,
# 	'e': 5
# }
# Выведите в консоль его ключи:
# 'a'
# 'b'
# 'c'
# 'd'
# 'e'

tst = {
	'a': 1,
	'b': 2,
	'c': 3,
	'd': 4,
	'e': 5
}
for key in tst:
    print(key)


# 2
# Дан словарь:
# tst = {
# 	2: 'a',
# 	4: 'b',
# 	6: 'c',
# 	8: 'd'
# }
# Выведите в консоль его ключи, кроме 8.

tst = {
	2: 'a',
	4: 'b',
	6: 'c',
	8: 'd'
}

for key in tst.keys():
 if key != 8:
    print(key)

# 3
# Дан словарь:
# tst = {
# 	'1': 'a',
# 	'2': 'b',
# 	'3': 'c',
# 	'4': 'd'
# }
# Получите из его ключей следующий кортеж:

# ('2', '3', '4')

tst = {
	'1': 'a',
	'2': 'b',
	'3': 'c',
	'4': 'd'
}
res = ()
for key in tst:
    if key in ('2', '3', '4'):
        res += (key,)
print(res)