# 1
# Даны два списка:
# tst1 = [1, 3, 5]
# tst2 = [2, 4, 6]
# Выведите их элементы попарно в виде кортежа.

tst1 = [1, 3, 5]
tst2 = [2, 4, 6]
for el in zip(tst1, tst2):
    print(el)

# 2
# Даны два списка:
# tst1 = ['a', 'b', 'c']
# tst2 = ['d', 'e', 'f']
# Получите из них следующий список:
# ['a', '1', 'b', '2', 'c', '3']

tst1 = ['a', 'b', 'c']
tst2 = ['d', 'e', 'f']
result = []
for item, el in zip(tst1, range(1, len(tst1) + 1)):
    result.append(item)
    result.append(str(el))

print(result)


# 3
# Даны три списка:
# tst1 = [11, 12, 13, 14]
# tst2 = [21, 22, 23, 24]
# tst3 = [31, 32, 33, 34]
# Сложите соответствующие элементы этих списков и результат запишите в новый список. Суммирование будет идти по следующему принципу:
# [
# 	11 + 21 + 31,
# 	12 + 22 + 32,
# 	13 + 23 + 33,
# 	14 + 24 + 34,
# ]

tst1 = [11, 12, 13, 14]
tst2 = [21, 22, 23, 24]
tst3 = [31, 32, 33, 34]
result = []
for el1, el2, el3 in zip(tst1, tst2, tst3):
    result.append(el1 + el2 + el3)

print(result)
