# 1.С помощью циклов заполните список следующими данными:
# [
# 	[1, 2, 3],
# 	[1, 2, 3],
# 	[1, 2, 3],
# ]

lst = []
for i in range(3): 
    sub_list = []  
    for j in range(1, 4): 
    	sub_list.append(j)
    lst.append(sub_list)  

print(lst)  # [[1, 2, 3], [1, 2, 3], [1, 2, 3]]



# 2.Даны два списка:

# lst1 = []
# lst2 = ['a', 'b', 'c']
# С помощью циклов заполните первый список элементами второго списка так, чтобы получить следующий результат:
# [
# 	['a', 'b', 'c'],
# 	['a', 'b', 'c'],
# ]

lst1 = []
st2 = ['a', 'b', 'c']

for _ in range(2):
	lst1.append(st2)
print(lst1) # [['a', 'b', 'c'], ['a', 'b', 'c']]